import Paragraph from "antd/lib/typography/Paragraph";
import React from "react";
import { PrimaryButton } from "../PrimaryButton/PrimaryButton";
import { ContentWrapper } from "../ContentWrapper/ContentWrapper";
import { Video } from "../Video/Video";
import styles from "./Intro.module.css";
import Text from "antd/lib/typography/Text";

export const Intro: React.FC<{
    setPage: React.Dispatch<React.SetStateAction<string>>;
}> = (props) => {
    return (
        <ContentWrapper title="به یکودو خوش آمدید">
            <div className={styles.introContentWrapper}>
                <div className={styles.introContentText}>
                    <Paragraph
                    className={styles.introText}
                        style={{
                            padding: "0 10px",
                            textAlign: "justify",
                            maxHeight: "365px",
                            overflowY: "scroll",
                        }}
                    >
                        <Text style={{ width: "100%", display: "block", fontWeight: 700, textAlign: "center" }}>
                            سلام به همه ی شما پدر و مادر های درجه یک !
                        </Text><br />
                        اینجا صفحه ی اختصاصی شماست توی سامانه ی یکودو... و قراره
                        اینجا کلی پاسکاری کنیم باهم! صاف و پوست کنده همین اول
                        کاری باید بگیم که «یکودو » قراره به چه درد پدر و مادرا
                        بخوره؟ حتما شما هم در مورد تربیت کودک تون و آینده ش با
                        کلی چالش و مسئله ی ریز و درشت رو به رو هستین... از اینکه
                        بچه ام شبا دیر میخوابه گرفته تا اینکه گوشه گیر شده و با
                        جمع نمی پره... از اینکه درست و حسابی غذا نمی خوره گرفته
                        تا اینکه تمرکز نداره و حواسش به یه کار جمع نمیشه...
                        احتمالا همه ی اینا و کلی نگرانی دیگه راجع به فرزندتون به
                        درستی شما رو درگیر خودش کرده... «یکودو» یک دستیار
                        اختصاصی برای بابا مامان هاست که با معرفی سرگرمی های
                        جورواجور به کودک شما کمک میکنه تا مهارت های مورد نیازش
                        تقویت بشن. اینجا برای فرزند شما یه نسخه ی اختصاصی پیچیده
                        میشه که مخصوص خودشه ... یه نسخه از جنس سرگرمی های جذاب و
                        سالمی که احتمالا کودک تون عاشقش میشه... از فیلم و
                        انیمیشن تا کاردستی و کتاب داستان از بازی دیجیتال تا
                        پادکست و قصه های صوتی و کلی اتفاق هیجان انگیز دیگه که
                        همه شون قراره به طور اختصاصی به رشد مهارت های کودک شما
                        کمک کنن... خبر خوب اینکه ، هر لحظه ای که شما اراده کنید
                        یه گزارش و کارنمای جامع و کاربردی از وضعیت فرزند خودتون
                        توی سامانه به شما ارائه میشه... اینجوری شما به راحتی
                        متوجه میشین که عزیز دردونه تون چقدر فیلم دیده یا بازی
                        کرده یا کاردستی ساخته و اینکه از هر کدوم از این سرگرمی
                        ها چه چیزایی یاد گرفته... فقط برای اینکه پیشنهاد های ما
                        به کمک شما دقیق تر به هدف بخوره لازمه که اول بتونیم
                        شناخت خوبی از فرزندتون به دست بیاریم و اینجوری مشخص بشه
                        که مثلا توی یک بازه ی یک ماهه یکودو چه جور سرگرمی هایی
                        به فرزند شما پیشنهاد بده.... اولین راه اینه که شما
                        خودتون به عنوان پدر و مادری که بیشترین شناخت از فرزندتون
                        رو دارین بعد از تماشای چهار تا فیلم کوتاه که هر کدومش
                        مربوط به معرفی یک حیطه رشدی میشه ، اعلام میکنید که علاقه
                        دارین کودک تون در یک ماه آینده بیشتر مشغول چه سرگرمی
                        هایی باشه... سرگرمی هایی که رشد شناختی یا حرکتی یا
                        اجتماعی یا هیجانی کودک رو تقویت میکنن... راه دوم هم
                        اینکه ،یک پرسشنامه ی کوتاه راجع به ویژگی های فرزندتون رو
                        تکمیل میکنید و ما به کمک نتایج اون اعلام میکنیم که نیاز
                        فعلی کودک شما کدوم دسته از مهارت هاست.... خلاصه اینکه
                        این تازه آغاز راهه... «یکودو» نوعی پاس گل تربیتی برای
                        حرفه ای هاست... راهی برای نزدیک شدن به دروازه و فتح
                        دروازه ی سربلندی کودکان مان... به امید قهرمانی قهرمان
                        های کوچولوی زندگی مون توی مسابقه ی عجیب و غریب این
                        روزگار ....
                    </Paragraph>
                    <PrimaryButton
                        onClick={() => props.setPage("addChild")}
                        style={{ minWidth: "180px" }}
                    >
                        افزودن فرزند
                    </PrimaryButton>
                </div>
                <Video />
            </div>
        </ContentWrapper>
    );
};
